//- Логічною змінною у мові програмування Java является boolean яка приймає значення true або false
//   Логічна вирази - вирази над зміними типу boolean з використанням логічних операцій
// - Найпопулярнішою логічною операцією є операція присвоєння "=", також існує операція логічного логічне "і" -"&&" лгічне "або"- "||"
// - Конструкція if-else дозволяє в залежності від деякого логічного значення виконувати різні частини програмного програми.
//В загальному випадку оператор записується :
//if (логічний вираз) оператор 1; [else оператор2;]
//Разділ else необовязковий.
//- Повне розгалуження: конструкція if/else - у випадку відповідності умові виконуються операції вказані в тілі конструкції if, в іншому випадку - операції в конструкції else.
//   Неповне розгалуження: конструкція if - у випадку відповідності умові виконуються операції вказані в тілі конструкції if, в іншому випадку - вони ігноруються.
//-Будь-яка конструкція вибору має містити умову і розгалуження. Коли виконувана програма доходить до конструкції вибору вона сперше
// перевіряє чи виконується умова, якщо умова виконується , то запускається програмний модуль,я кий записакний в середині цієї конструкції.
//Якщо умова не виконалась перевіряєтся наступна умова, або виконується операція else. Після виходу з конструкції вибору програма продовжує своє виконання.

package Lab3;

import java.io.IOException;

public class Lab3 {public static void main(String[] args) throws IOException {
    int z = 10, e = 8, a = 10;
    float min = (float) (-10.0 - 2.5 * 21.0);
    float max = (float) (5.0 + 1.2 * 21.0);
    float step = (float) (0.5 + 21.0 / 20.0);
    float x;
//        System.out.println(min);
//        System.out.println(max);
//        System.out.println(step);

    System.out.println("Цикл for:");

    for (x = min; x <= max; x = x + step) {
      //  System.out.println("min= "+x);
        if(x<0) {
            System.out.println("Недопустиме значення");
        }
        else{
            met(z, e, a, x);
        }
    }
    System.out.println();
    System.out.println("Цикл while:");
    x = min;
    while (x <= max) {
        if(x<=0) {
            System.out.println("Недопустиме значення");
        }
        else{
            met(z, e, a, x);
        }
        x = x + step;
    }
}


    private static void met(int z1, int e1, int a1, float x1) {

        double p1, p2, p3;
        p1 = Math.pow((z1 + Math.sqrt((z1 * x1))), 1.0 / 5);
        p2 = Math.pow(e1, x1) + Math.pow(a1, 5) * Math.atan(Math.tan(x1));
        p3 = p1 / p2;

        System.out.println("N= " + p3);
    }
}
