//1. Клас - певна абстрактна сутність, наприклад, "Пес", "Кіт", "Автомобіль",
//        що на програмному рівні представлена змінними та методами, що оперують над цими полями даних.
//        Об'єкт - конкретний екземпляр класу. По суті, це клас, поля якого ініціалізовані і він завантажений у пам'ять комп'ютера.
//        На основі одного класу, можна створити безліч об'єктів.
//        Через методи реалізується "поведінка" об'єктів, майже вся робота з об'єктами відбувається через методи.
//        Конструктор - спеціальний метод що викликаеться при створенні нового об'єкта классу.
//        Поле - змінна класу яка не визначенна завчасно та може приймати різні значення окремо для кожного об'єкта.
//
//        2. Інкапсуляція - побудова класів через закриття їхньої реалізації.
//        Поліморфізм - можливість використання батьківських класів замість класів нащадків. По суті є частиною реалізованої в мові концепції успадкування.
//
//        3. Пакети дуже схожі зі звичайною файловою системою комп'ютера і являються дуже зручними та корисними для структуризації классів та інших єлементів программи
//        Для взаємодії з класом іншого пакету спочатку треба підключити пакет в осередку файла з класом в якому виконуються дії.
//
//        4. public - публічний доступ з любого программоного кода або пакета.
//private - елементи класа з модифікатоом private являються прихованими та  доступ до них є тільки у методів данного класу.
//protected - є повністю видимим в межах свого пакету та може бути видимим в похідних классах що знаходяться в інших пакетах.
//
//        5. Статичні атрибути - атрибути що являються спільними для всіх об'єктів класу,
//        змінивши данні статичного атрибуту в одному об'єкті - вони змінятся для всіх об'єктів цього класу.
//
//6. Статичний метод - метод який викликається без створення об'єкта классу та виконується незалежно від його параметів та може звертатися тільки до статичних методів та змінних.

package Lab4;

import Lab4.pac.MathClass;


import java.io.IOException;

public class Lab4 {



       static public void main(String[] args) throws IOException {
            MathClass mathClass=new MathClass();
          int z = 10, e = 8, a = 10;
            float min = (float) (-10.0 - 2.5 * 21.0);
            float max = (float) (5.0 + 1.2 * 21.0);
            float step = (float) (0.5 + 21.0 / 20.0);
            float x;
          //  System.out.println(min);
          //  System.out.println(max);
           // System.out.println(step);


            System.out.println("Цикл for:");

            for (x = min; x <= max; x = x + step) {
                System.out.println("x= "+x);
                mathClass.met(z, e, a, x);
            }
            System.out.println();
            System.out.println("Цикл while:");
            x = min;
            while (x <= max) {
                System.out.println("x= "+x);
              met(z, e, a, x);
                x = x + step;
            }
        }
    public static void met(int z1, int e1, int a1, float x1) {

        double p1, p2, p3;
        p1 = Math.pow((z1 + Math.sqrt((z1 * x1))), 1.0 / 5);
        p2 = Math.pow(e1, x1) + Math.pow(a1, 5) * Math.atan(Math.tan(x1));
        p3 = p1 / p2;

        System.out.println("N= " + p3);
    }


    }

